WeeDom/gel-controller/esp32cam/CameraWebServer/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"
#include "board_config.h"
#include <WiFi.h>
#include <string.h>
#include <vector>
#include <time.h>
#include <mbedtls/md.h>

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// LED FLASH setup
#if defined(LED_GPIO_NUM)
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = CONFIG_LED_MAX_INTENSITY;
bool isStreaming = false;

#endif

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

// camera metadata to expose to controller
static char device_name[32] = "cam1";
static char room_id[32]    = "unknown";
static char location[32]   = "unknown";
static float poll_interval = 10.0f;
static char device_mac[18] = "";  // MAC address buffer

// Shared-secret auth (Phase 1)
// Configure these to match controller-side values.
static const bool AUTH_ENABLED = true;
static const char *AUTH_DEFAULT_CONTROLLER_ID = "gel-controller-1";
static const char *AUTH_DEFAULT_SHARED_SECRET = "niapcinimod";
static const long AUTH_MAX_SKEW_SECONDS = 45;
static const size_t AUTH_NONCE_CACHE_SIZE = 32;

// Pairing flow (Phase 2)
static const long PAIRING_WINDOW_SECONDS = 300;
static long pairing_open_until = 0;

static char auth_controller_id[48] = "gel-controller-1";
static char auth_shared_secret[96] = "niapcinimod";

typedef struct {
  char nonce[40];
  long seen_at;
} auth_nonce_entry_t;

static auth_nonce_entry_t auth_nonce_cache[AUTH_NONCE_CACHE_SIZE];
static size_t auth_nonce_cache_pos = 0;

static void clear_nonce_cache() {
  memset(auth_nonce_cache, 0, sizeof(auth_nonce_cache));
  auth_nonce_cache_pos = 0;
}

static bool is_pairing_open() {
  long now_ts = (long)time(NULL);
  return pairing_open_until > now_ts;
}

static void open_pairing_window() {
  long now_ts = (long)time(NULL);
  pairing_open_until = now_ts + PAIRING_WINDOW_SECONDS;
}

static void close_pairing_window() {
  pairing_open_until = 0;
}

static long pairing_seconds_left() {
  long now_ts = (long)time(NULL);
  long remaining = pairing_open_until - now_ts;
  return remaining > 0 ? remaining : 0;
}

static const char *method_to_string(int method) {
  switch (method) {
    case HTTP_GET: return "GET";
    case HTTP_POST: return "POST";
    case HTTP_PUT: return "PUT";
    case HTTP_DELETE: return "DELETE";
    case HTTP_HEAD: return "HEAD";
    case HTTP_PATCH: return "PATCH";
    default: return "OTHER";
  }
}

static bool get_header_value(httpd_req_t *req, const char *name, char *out, size_t out_len) {
  size_t hdr_len = httpd_req_get_hdr_value_len(req, name);
  if (hdr_len == 0 || hdr_len + 1 > out_len) {
    return false;
  }
  if (httpd_req_get_hdr_value_str(req, name, out, out_len) != ESP_OK) {
    return false;
  }
  return true;
}

static bool get_query_string(httpd_req_t *req, char *out, size_t out_len) {
  size_t query_len = httpd_req_get_url_query_len(req);
  if (query_len == 0) {
    out[0] = '\0';
    return true;
  }
  if (query_len + 1 > out_len) {
    return false;
  }
  return httpd_req_get_url_query_str(req, out, out_len) == ESP_OK;
}

static bool timing_safe_hex_equals(const char *a, const char *b) {
  size_t al = strlen(a);
  size_t bl = strlen(b);
  if (al != bl) {
    return false;
  }
  unsigned char diff = 0;
  for (size_t i = 0; i < al; ++i) {
    diff |= (unsigned char)(a[i] ^ b[i]);
  }
  return diff == 0;
}

static bool nonce_seen_recently(const char *nonce, long now_ts) {
  for (size_t i = 0; i < AUTH_NONCE_CACHE_SIZE; ++i) {
    if (auth_nonce_cache[i].nonce[0] == '\0') {
      continue;
    }
    if (strcmp(auth_nonce_cache[i].nonce, nonce) == 0) {
      if (labs(now_ts - auth_nonce_cache[i].seen_at) <= AUTH_MAX_SKEW_SECONDS) {
        return true;
      }
    }
  }
  return false;
}

static void remember_nonce(const char *nonce, long now_ts) {
  strlcpy(auth_nonce_cache[auth_nonce_cache_pos].nonce, nonce, sizeof(auth_nonce_cache[auth_nonce_cache_pos].nonce));
  auth_nonce_cache[auth_nonce_cache_pos].seen_at = now_ts;
  auth_nonce_cache_pos = (auth_nonce_cache_pos + 1) % AUTH_NONCE_CACHE_SIZE;
}

static bool hmac_sha256_hex(const char *secret, const char *message, char *out_hex, size_t out_hex_len) {
  if (out_hex_len < 65) {
    return false;
  }

  unsigned char digest[32];
  const mbedtls_md_info_t *md_info = mbedtls_md_info_from_type(MBEDTLS_MD_SHA256);
  if (!md_info) {
    return false;
  }

  int rc = mbedtls_md_hmac(md_info,
                           (const unsigned char *)secret,
                           strlen(secret),
                           (const unsigned char *)message,
                           strlen(message),
                           digest);
  if (rc != 0) {
    return false;
  }

  for (size_t i = 0; i < sizeof(digest); ++i) {
    snprintf(out_hex + (i * 2), 3, "%02x", digest[i]);
  }
  out_hex[64] = '\0';
  return true;
}

static esp_err_t send_auth_error(httpd_req_t *req, const char *message, const char *code) {
  httpd_resp_set_status(req, code);
  httpd_resp_set_type(req, "application/json");
  return httpd_resp_sendstr(req, message);
}

