WeeDom/gel-controller/esp32cam/CameraWebServer/app_httpd.cpp
static bool authorize_request(httpd_req_t *req) {
  if (!AUTH_ENABLED) {
    return true;
  }

  char controller_id[48];
  char timestamp_str[24];
  char nonce[40];
  char signature[96];
  char query[160];

  if (!get_header_value(req, "X-Controller-Id", controller_id, sizeof(controller_id))
      || !get_header_value(req, "X-Timestamp", timestamp_str, sizeof(timestamp_str))
      || !get_header_value(req, "X-Nonce", nonce, sizeof(nonce))
      || !get_header_value(req, "X-Signature", signature, sizeof(signature))) {
    send_auth_error(req, "{\"error\":\"missing auth headers\"}", "401 Unauthorized");
    return false;
  }

  if (strcmp(controller_id, auth_controller_id) != 0) {
    send_auth_error(req, "{\"error\":\"controller mismatch\"}", "403 Forbidden");
    return false;
  }

  char *endptr = NULL;
  long request_ts = strtol(timestamp_str, &endptr, 10);
  if (endptr == timestamp_str || *endptr != '\0') {
    send_auth_error(req, "{\"error\":\"invalid timestamp\"}", "401 Unauthorized");
    return false;
  }

  long now_ts = (long)time(NULL);
  if (now_ts <= 0 || labs(now_ts - request_ts) > AUTH_MAX_SKEW_SECONDS) {
    send_auth_error(req, "{\"error\":\"stale timestamp\"}", "408 Request Timeout");
    return false;
  }

  if (!get_query_string(req, query, sizeof(query))) {
    send_auth_error(req, "{\"error\":\"query too long\"}", "400 Bad Request");
    return false;
  }

  if (nonce_seen_recently(nonce, now_ts)) {
    send_auth_error(req, "{\"error\":\"nonce replay\"}", "409 Conflict");
    return false;
  }

  char signing_input[320];
  snprintf(
    signing_input,
    sizeof(signing_input),
    "%s\n%s\n%s\n%s\n%s",
    method_to_string(req->method),
    req->uri,
    query,
    timestamp_str,
    nonce
  );

  char expected_sig[65];
  if (!hmac_sha256_hex(auth_shared_secret, signing_input, expected_sig, sizeof(expected_sig))) {
    send_auth_error(req, "{\"error\":\"signature generation failed\"}", "500 Internal Server Error");
    return false;
  }

  if (!timing_safe_hex_equals(signature, expected_sig)) {
    send_auth_error(req, "{\"error\":\"invalid signature\"}", "401 Unauthorized");
    return false;
  }

  remember_nonce(nonce, now_ts);
  return true;
}

static esp_err_t pair_status_handler(httpd_req_t *req) {
  char resp[220];
  int len = snprintf(
    resp,
    sizeof(resp),
    "{\"device_id\":\"%s\",\"pairing_open\":%s,\"pairing_seconds_left\":%ld,\"controller_id\":\"%s\"}",
    device_mac,
    is_pairing_open() ? "true" : "false",
    pairing_seconds_left(),
    auth_controller_id
  );
  httpd_resp_set_type(req, "application/json");
  return httpd_resp_send(req, resp, len);
}

static esp_err_t pair_open_handler(httpd_req_t *req) {
  if (!authorize_request(req)) {
    return ESP_FAIL;
  }

  open_pairing_window();
  char resp[120];
  int len = snprintf(resp, sizeof(resp), "{\"ok\":true,\"pairing_seconds_left\":%ld}", pairing_seconds_left());
  httpd_resp_set_type(req, "application/json");
  return httpd_resp_send(req, resp, len);
}

static esp_err_t pair_claim_handler(httpd_req_t *req) {
  if (!is_pairing_open()) {
    return send_auth_error(req, "{\"error\":\"pairing is closed\"}", "403 Forbidden");
  }

  char buf[260];
  int rlen = httpd_req_recv(req, buf, min((int)sizeof(buf) - 1, (int)req->content_len));
  if (rlen <= 0) {
    return httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Failed to read request");
  }
  buf[rlen] = 0;

  char controller_tmp[48];
  char secret_tmp[96];
  if (sscanf(buf, "{\"controller_id\":\"%47[^\"]\",\"shared_secret\":\"%95[^\"]\"}", controller_tmp, secret_tmp) != 2) {
    return httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid payload");
  }

  if (strlen(controller_tmp) < 3 || strlen(secret_tmp) < 8) {
    return httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Values too short");
  }

  strlcpy(auth_controller_id, controller_tmp, sizeof(auth_controller_id));
  strlcpy(auth_shared_secret, secret_tmp, sizeof(auth_shared_secret));
  clear_nonce_cache();
  close_pairing_window();

  httpd_resp_set_type(req, "application/json");
  return httpd_resp_sendstr(req, "{\"ok\":true,\"state\":\"paired_locked\"}");
}

static esp_err_t props_get_handler(httpd_req_t *req) {
  if (!authorize_request(req)) {
    return ESP_FAIL;
  }
  char resp[220];
  int len = snprintf(resp, sizeof(resp),
    "{\"name\":\"%s\",\"room_id\":\"%s\",\"location\":\"%s\",\"poll_interval\":%.1f}",
    device_name, room_id, location, poll_interval);
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, resp, len);
}

// very light JSON parsing to keep deps out; swap for ArduinoJson if you prefer
static esp_err_t props_set_handler(httpd_req_t *req) {
  if (!authorize_request(req)) {
    return ESP_FAIL;
  }
  char buf[220];
  int rlen = httpd_req_recv(req, buf, min((int)sizeof(buf) - 1, (int)req->content_len));
  if (rlen <= 0) return httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Failed to read request");
  buf[rlen] = 0;

  char name_tmp[32], room_tmp[32], location_tmp[32];
  float poll_tmp;
  if (sscanf(
        buf,
        "{\"name\":\"%31[^\"]\",\"room_id\":\"%31[^\"]\",\"location\":\"%31[^\"]\",\"poll_interval\":%f}",
        name_tmp,
        room_tmp,
        location_tmp,
        &poll_tmp
      ) == 4) {
    strlcpy(device_name, name_tmp, sizeof(device_name));
    strlcpy(room_id, room_tmp, sizeof(room_id));
    strlcpy(location, location_tmp, sizeof(location));
    poll_interval = poll_tmp;
  } else if (sscanf(buf, "{\"name\":\"%31[^\"]\",\"room_id\":\"%31[^\"]\",\"poll_interval\":%f}",
                    name_tmp, room_tmp, &poll_tmp) == 3) {
    strlcpy(device_name, name_tmp, sizeof(device_name));
    strlcpy(room_id, room_tmp, sizeof(room_id));
    poll_interval = poll_tmp;
  }
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, "ok", 2);
}

typedef struct {
  size_t size;   //number of values used for filtering
  size_t index;  //current value index
  size_t count;  //value count
  int sum;
  int *values;  //array to be filled with values
} ra_filter_t;

