WeeDom/gel-controller/esp32cam/CameraWebServer/app_httpd.cpp
static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size) {
  memset(filter, 0, sizeof(ra_filter_t));

  filter->values = (int *)malloc(sample_size * sizeof(int));
  if (!filter->values) {
    return NULL;
  }
  memset(filter->values, 0, sample_size * sizeof(int));

  filter->size = sample_size;
  return filter;
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
static int ra_filter_run(ra_filter_t *filter, int value) {
  if (!filter->values) {
    return value;
  }
  filter->sum -= filter->values[filter->index];
  filter->values[filter->index] = value;
  filter->sum += filter->values[filter->index];
  filter->index++;
  filter->index = filter->index % filter->size;
  if (filter->count < filter->size) {
    filter->count++;
  }
  return filter->sum / filter->count;
}
#endif

#if defined(LED_GPIO_NUM)
void enable_led(bool en) {  // Turn LED On or Off
  int duty = en ? led_duty : 0;
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY)) {
    duty = CONFIG_LED_MAX_INTENSITY;
  }
  ledcWrite(LED_GPIO_NUM, duty);
  //ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
  //ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
  log_i("Set LED intensity to %d", duty);
}
#endif

static esp_err_t bmp_handler(httpd_req_t *req) {
  if (!authorize_request(req)) {
    return ESP_FAIL;
  }
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_start = esp_timer_get_time();
#endif
  fb = esp_camera_fb_get();
  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/x-windows-bmp");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.bmp");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

  uint8_t *buf = NULL;
  size_t buf_len = 0;
  bool converted = frame2bmp(fb, &buf, &buf_len);
  esp_camera_fb_return(fb);
  if (!converted) {
    log_e("BMP Conversion failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  res = httpd_resp_send(req, (const char *)buf, buf_len);
  free(buf);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_end = esp_timer_get_time();
#endif
  log_i("BMP: %llums, %uB", (uint64_t)((fr_end - fr_start) / 1000), buf_len);
  return res;
}

static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len) {
  jpg_chunking_t *j = (jpg_chunking_t *)arg;
  if (!index) {
    j->len = 0;
  }
  if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK) {
    return 0;
  }
  j->len += len;
  return len;
}

static esp_err_t send_jpeg_with_exif(httpd_req_t *req, const uint8_t *jpeg_buf, size_t jpeg_len, const char *description) {
  if (!jpeg_buf || jpeg_len < 2) {
    return ESP_FAIL;
  }

  // If not a valid JPEG SOI, send raw bytes as-is.
  if (!(jpeg_buf[0] == 0xFF && jpeg_buf[1] == 0xD8)) {
    return httpd_resp_send(req, (const char *)jpeg_buf, jpeg_len);
  }

  const char *safe_desc = description ? description : "";
  size_t desc_len = strlen(safe_desc) + 1;  // include trailing NUL for ASCII EXIF value

  // EXIF APP1 payload:
  // Exif\0\0 + TIFF header + IFD0 (1 entry) + next IFD offset + description bytes
  const size_t exif_payload_len = 6 + 8 + 2 + 12 + 4 + desc_len;
  // APP1 length field includes itself.
  const size_t app1_len_field = exif_payload_len + 2;
  if (app1_len_field > 0xFFFF) {
    return ESP_FAIL;
  }

  std::vector<uint8_t> app1;
  app1.reserve(2 + 2 + exif_payload_len);

  // APP1 marker and length
  app1.push_back(0xFF);
  app1.push_back(0xE1);
  app1.push_back((uint8_t)((app1_len_field >> 8) & 0xFF));
  app1.push_back((uint8_t)(app1_len_field & 0xFF));

  // "Exif\0\0"
  app1.push_back('E');
  app1.push_back('x');
  app1.push_back('i');
  app1.push_back('f');
  app1.push_back(0x00);
  app1.push_back(0x00);

  // TIFF header (little-endian): "II", 42, IFD0 offset 8
  app1.push_back(0x49);
  app1.push_back(0x49);
  app1.push_back(0x2A);
  app1.push_back(0x00);
  app1.push_back(0x08);
  app1.push_back(0x00);
  app1.push_back(0x00);
  app1.push_back(0x00);

  // IFD0 entry count = 1
  app1.push_back(0x01);
  app1.push_back(0x00);

  // Tag: ImageDescription (0x010E), Type: ASCII (2)
  app1.push_back(0x0E);
  app1.push_back(0x01);
  app1.push_back(0x02);
  app1.push_back(0x00);

  uint32_t count = (uint32_t)desc_len;
  app1.push_back((uint8_t)(count & 0xFF));
  app1.push_back((uint8_t)((count >> 8) & 0xFF));
  app1.push_back((uint8_t)((count >> 16) & 0xFF));
  app1.push_back((uint8_t)((count >> 24) & 0xFF));

  // Offset to description string from start of TIFF header.
  uint32_t value_offset = 0x1A;  // 8 (TIFF) + 2 (count) + 12 (entry) + 4 (next IFD)
  app1.push_back((uint8_t)(value_offset & 0xFF));
  app1.push_back((uint8_t)((value_offset >> 8) & 0xFF));
  app1.push_back((uint8_t)((value_offset >> 16) & 0xFF));
  app1.push_back((uint8_t)((value_offset >> 24) & 0xFF));

  // Next IFD offset = 0
  app1.push_back(0x00);
  app1.push_back(0x00);
  app1.push_back(0x00);
  app1.push_back(0x00);

  // ImageDescription value bytes
  app1.insert(app1.end(), safe_desc, safe_desc + strlen(safe_desc));
  app1.push_back(0x00);

  esp_err_t res = ESP_OK;
  res = httpd_resp_send_chunk(req, (const char *)jpeg_buf, 2);  // SOI
  if (res != ESP_OK) return res;

  res = httpd_resp_send_chunk(req, (const char *)app1.data(), app1.size());
  if (res != ESP_OK) return res;

  res = httpd_resp_send_chunk(req, (const char *)(jpeg_buf + 2), jpeg_len - 2);
  if (res != ESP_OK) return res;

  return httpd_resp_send_chunk(req, NULL, 0);
}

static esp_err_t capture_handler(httpd_req_t *req) {
  if (!authorize_request(req)) {
    return ESP_FAIL;
  }
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_start = esp_timer_get_time();
#endif

#if defined(LED_GPIO_NUM)
  enable_led(true);
  vTaskDelay(150 / portTICK_PERIOD_MS);  // The LED needs to be turned on ~150ms before the call to esp_camera_fb_get()
  fb = esp_camera_fb_get();              // or it won't be visible in the frame. A better way to do this is needed.
  enable_led(false);
#else
  fb = esp_camera_fb_get();
#endif

