WeeDom/gel-controller/esp32cam/CameraWebServer/app_httpd.cpp
  httpd_uri_t win_uri = {
    .uri = "/resolution",
    .method = HTTP_GET,
    .handler = win_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t props_get_uri = {
    .uri="/props", .method=HTTP_GET,
    .handler=props_get_handler,
    .user_ctx=NULL };

  httpd_uri_t props_set_uri = {
    .uri="/props", .method=HTTP_POST,
    .handler=props_set_handler,
    .user_ctx=NULL };

  httpd_uri_t pair_status_uri = {
    .uri="/pair/status", .method=HTTP_GET,
    .handler=pair_status_handler,
    .user_ctx=NULL };

  httpd_uri_t pair_open_uri = {
    .uri="/pair/open", .method=HTTP_POST,
    .handler=pair_open_handler,
    .user_ctx=NULL };

  httpd_uri_t pair_claim_uri = {
    .uri="/pair/claim", .method=HTTP_POST,
    .handler=pair_claim_handler,
    .user_ctx=NULL };



  ra_filter_init(&ra_filter, 20);

  log_i("Starting web server on port: '%d'", config.server_port);
  if (httpd_start(&camera_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &index_head_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &bmp_uri);

    httpd_register_uri_handler(camera_httpd, &xclk_uri);
    httpd_register_uri_handler(camera_httpd, &reg_uri);
    httpd_register_uri_handler(camera_httpd, &greg_uri);
    httpd_register_uri_handler(camera_httpd, &pll_uri);
    httpd_register_uri_handler(camera_httpd, &win_uri);

    httpd_register_uri_handler(camera_httpd, &props_get_uri);
    httpd_register_uri_handler(camera_httpd, &props_set_uri);
    httpd_register_uri_handler(camera_httpd, &pair_status_uri);
    httpd_register_uri_handler(camera_httpd, &pair_open_uri);
    httpd_register_uri_handler(camera_httpd, &pair_claim_uri);

  }

  config.server_port += 1;
  config.ctrl_port += 1;
  log_i("Starting stream server on port: '%d'", config.server_port);
  if (httpd_start(&stream_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
  }
}

void setupLedFlash() {
#if defined(LED_GPIO_NUM)
  ledcAttach(LED_GPIO_NUM, 5000, 8);
  // Force known OFF state at boot.
  enable_led(false);
  log_i("LED flash configured on GPIO %d (capture intensity: %d)", LED_GPIO_NUM, led_duty);
#else
  log_i("LED flash is disabled -> LED_GPIO_NUM undefined");
#endif
}
